[
  "via vectors that trigger incorrect iocb management.",
  "via vectors that trigger an m_start error.",
  "via vectors involving an attempted register access that triggers an unexpected value in the Exception Syndrome Register (ESR).",
  "via vectors related to a large number of coefficients.",
  "via vectors that trigger a large amount of database usage.",
  "via vectors that trigger the aborting of an IndexedDB transaction.",
  "via vectors related to the handling of extension tabs.",
  "via vectors that trigger stopping a worker process that had been handling an Event object.",
  "Specifying an invalid format specifier",
  "crafted EXIF data that triggers an attempt to divide the minimum representable negative integer by -1",
  "via an invalid character in a PTR response",
  "via attempted access to a special file",
  "a successful LDAP query with no results",
  "via an ASN.1 BER file that lacks a public key",
  "via a crafted request to the (1) editnetwork, (2) editchan, (3) addchan, or (4) delchan page",
  "via crafted keyctl commands that negatively instantiate a key",
  "via a long RPC reply",
  "via a crafted (1) bbversion, (2) prev_hash, (3) nbit, or (4) ntime parameter in a mining.notify action stratum message",
  "via a malformed ASCONF chunk",
  "via crafted JSON data",
  "via a flood of SYN+FIN TCP packets",
  "via a crafted no-journal filesystem",
  "via a long line that triggers excessive memory allocation.  NOTE: some of these details are obtained from third party information",
  "via an APE (aka Monkey's Audio) file that contains a header but no frames",
  "via a crafted application that sends a Netlink message.  NOTE: this vulnerability exists because of an incorrect fix for CVE-2012-2669",
  "via crafted TCP packets that trigger a small MSS value",
  "via an escape sequence with a large repeat count value",
  "via a malformed ext4 filesystem containing a super block with a large FLEX_BG group size (aka s_log_groups_per_flex value).  NOTE: this vulnerability exists because of an incomplete fix for CVE-2009-4307",
  "via a crafted vendorLength field in an ogg file",
  "via a clock_gettime system call",
  "via a crafted ICR write operation in x2apic mode",
  "via a VAPIC synchronization operation involving a page-end address",
  "via filesystem write operations on a read-only disk that supports the (1) BLKIF_OP_DISCARD (aka discard or TRIM) or (2) SCSI UNMAP feature",
  "via a TGS-REQ request that triggers an attempted cross-realm referral for a host-based service principal",
  "via a crafted batman-adv ICMP packet",
  "via a LOCK_UN flock system call",
  "via a large number of (1) program or (2) section headers or (3) invalid capabilities",
  "via a crafted iso9660 image with a self-referential CL entry",
  "via duplicate ASCONF chunks that trigger an incorrect uncork within the side-effect interpreter",
  "via an IKEv2 I1 notification without a KE payload",
  "via crafted keyctl commands",
  "via a crafted fallocate zero-range request",
  "via a long string",
  "via a large number of notes",
  "via a certain use of a ModR/M byte in an undefined instruction",
  "via an invalid color index",
  "via a CPIO archive with a large symlink",
  "via a USB device without both a master and a slave interface",
  "via the entries value in a dref box in an MP4 file",
  "via the */op ** command in a query",
  "via a crafted USB device",
  "via JPEG data that is too short",
  "via a crafted DNS response with an empty question section",
  "via a crafted image",
  "via a series of KEY_REQKEY_DEFL_THREAD_KEYRING keyctl_set_reqkey_keyring calls",
  "via a crafted file",
  "via a crafted plist file",
  "via (1) an application that makes crafted system calls or possibly (2) IPv4 traffic with invalid IP options",
  "via a series of requests for a large file using an HTTP Range header",
  "via a mat file with an invalid number of frames",
  "via an unauthenticated connection",
  "via a crafted DDS file",
  "via a crafted png file",
  "via crafted logconfig commands",
  "via a list with a large number of elements",
  "via crafted text with invalid Unicode sequences",
  "via crafted use of mlockall and munlockall system calls",
  "via DIO requests",
  "via a response with chunked transfer coding",
  "via a crafted document",
  "via a crafted web site"
]